const AboutSection = () => {
  return (
    <section className="py-12 sm:py-16 md:py-20 gradient-papyrus">
      <div className="container px-4">
        <div className="max-w-4xl mx-auto text-center">
          <h2 className="text-3xl sm:text-4xl md:text-5xl font-serif text-primary mb-6 sm:mb-8">
            Ερευνητικές Δραστηριότητες και Αποστολή του Εργαστηρίου
          </h2>
          <p className="text-base sm:text-lg text-foreground/80 leading-relaxed mb-4 sm:mb-6 px-2">
            Το Εργαστήριο Δημιουργίας και Επεξεργασίας Φορέων Γραφής Λατινικών  και Αρχαίων Κειμένων (Πάπυρος) του Πανεπιστημίου Ιωαννίνων γεφυρώνει την Κλασική Φιλολογία με τις σύγχρονες τεχνολογίες. Δραστηριοποιείται στους τομείς της Παλαιογραφίας, της Παπυρολογίας και των Ψηφιακών Ανθρωπιστικών Επιστημών (Digital Humanities), εστιάζοντας τόσο στην παραγωγή υλικών γραφής όσο και στον ψηφιακό μετασχηματισμό κειμενικών πόρων.
            Μέσα από τη διεπιστημονική έρευνα, την ψηφιοποίηση αρχείων και την ανάπτυξη ηλεκτρονικών εργαλείων, το Εργαστήριο στοχεύει στη διάσωση της πολιτιστικής κληρονομιάς και την ενίσχυση της Δια Βίου Μάθησης. Παράλληλα, προσφέρει εξειδικευμένα ακαδημαϊκά και επαγγελματικά εφόδια στους φοιτητές, συνδέοντας το Τμήμα Φιλολογίας με την κοινωνία, την αγορά εργασίας και ερευνητικούς φορείς στην Ελλάδα και το εξωτερικό.
          </p>
        </div>
      </div>
    </section>
  );
};

export default AboutSection;
